EA/src/Catalogs/ШкалыПлановКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ШкалыПлановКонтрактов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Диапазоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НижняяГраница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Catalogs/ШкалыПлановКонтрактов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	НижниеГраницы = Новый Массив;
	Для Каждого СтрокаТЧ Из Диапазоны Цикл
		Если НижниеГраницы.Найти(СтрокаТЧ.НижняяГраница) <> Неопределено Тогда
			Сообщить("Для границы " + СтрокаТЧ.НижняяГраница + " уже указан бюджет плана.", СтатусСообщения.Важное);
			Отказ = Истина;
		Иначе
			НижниеГраницы.Добавить(СтрокаТЧ.НижняяГраница);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
